Danh555/code_cuadanh/Dự án led p10/Matrix_sent2Danh/Lib/WIFIMANAGER-ESP32-master_running/WiFiManager.h
/**************************************************************
   WiFiManager is a library for the ESP8266/Arduino platform
   (https://github.com/esp8266/Arduino) to enable easy
   configuration and reconfiguration of WiFi credentials using a Captive Portal
   inspired by:
   http://www.esp8266.com/viewtopic.php?f=29&t=2520
   https://github.com/chriscook8/esp-arduino-apboot
   https://github.com/esp8266/Arduino/tree/master/libraries/DNSServer/examples/CaptivePortalAdvanced
   Built by AlexT https://github.com/tzapu
   Licensed under MIT license
 **************************************************************/

#ifndef WiFiManager_h
#define WiFiManager_h

#if defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#else
#include <WiFi.h>
#include <WebServer.h>
#endif
#include <DNSServer.h>
#include <memory>


#include <Update.h> //mrCong them

#if defined(ESP8266)
extern "C" {
  #include "user_interface.h"
}
#define ESP_getChipId()   (ESP.getChipId())
#else
#include <esp_wifi.h>
#define ESP_getChipId()   ((uint32_t)ESP.getEfuseMac())
#endif

const char HTTP_HEAD_CONG[] PROGMEM            = "<!DOCTYPE html><html lang=\"en\"><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1, user-scalable=no\"/><title>{v}</title>";
const char HTTP_STYLE[] PROGMEM           = "<style>.c{text-align: center;} div,input{padding:5px;font-size:1em;} input{width:95%;} body{text-align: center;font-family:verdana;} button{border:0;border-radius:0.3rem;background-color:#1fa3ec;color:#fff;line-height:2.4rem;font-size:1.2rem;width:100%;} .q{float: right;width: 64px;text-align: right;} .l{background: url(\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAMAAABEpIrGAAAALVBMVEX///8EBwfBwsLw8PAzNjaCg4NTVVUjJiZDRUUUFxdiZGSho6OSk5Pg4eFydHTCjaf3AAAAZElEQVQ4je2NSw7AIAhEBamKn97/uMXEGBvozkWb9C2Zx4xzWykBhFAeYp9gkLyZE0zIMno9n4g19hmdY39scwqVkOXaxph0ZCXQcqxSpgQpONa59wkRDOL93eAXvimwlbPbwwVAegLS1HGfZAAAAABJRU5ErkJggg==\") no-repeat left center;background-size: 1em;}</style>";
const char HTTP_SCRIPT[] PROGMEM          = "<script>function c(l){document.getElementById('s').value=l.innerText||l.textContent;document.getElementById('p').focus();}</script>";
const char HTTP_HEAD_END[] PROGMEM        = "</head><body><div style='text-align:left;display:inline-block;min-width:260px;'>";
const char HTTP_PORTAL_OPTIONS[] PROGMEM  = "<form action=\"/0wifi\" method=\"get\"><button>Setting system</button></form><br/><form action=\"/updateFirm\" method=\"get\"><button>Updade Firmware</button></form><br/><form action=\"/configled\" method=\"get\"><button>Config Led Screen</button></form><br/><form action=\"/e\" method=\"post\"><button>Exit</button></form>";
// const char HTTP_PORTAL_OPTIONS[] PROGMEM  = "<form action=\"/wifi\" method=\"get\"><button>Configure WiFi</button></form><br/><form action=\"/0wifi\" method=\"get\"><button>Configure WiFi (No Scan)</button></form><br/>";
//<form action=\"/i\" method=\"get\"><button>Info</button></form><br/><form action=\"/r\" method=\"post\"><button>Reset</button></form>";
const char HTTP_ITEM[] PROGMEM            = "<div><a href='#p' onclick='c(this)'>{v}</a>&nbsp;<span class='q {i}'>{r}%</span></div>";
const char HTTP_FORM_START[] PROGMEM      = "<form method='get' action='wifisave'><input id='s' name='s' length=32 placeholder='SSID'><br/><input id='p' name='p' length=64 type='password' placeholder='password'><br/>";
const char HTTP_FORM_PARAM[] PROGMEM      = "<br/><input id='{i}' name='{n}' length={l} placeholder='{p}' value='{v}' {c}>";
const char HTTP_FORM_END[] PROGMEM        = "<br/><button type='submit'>save</button></form>";
const char HTTP_SCAN_LINK[] PROGMEM       = "<br/><div class=\"c\"><a href=\"/wifi\">Scan</a></div>";
const char HTTP_SAVED[] PROGMEM           = "<div>Credentials Saved<br />Trying to connect Weread to network.<br />If it fails reconnect to AP to try again</div>";
const char HTTP_END[] PROGMEM             = "</div></body></html>";

//---------MrCong add------------------------

// const char HTTP_PORTAL_OPTIONSF[] PROGMEM  = "<form action=\"/iF\" method=\"get\"><button>Info</button></form><br/><form action=\"/rF\" method=\"post\"><button>Reset Factory</button></form><br/><form action=\"/updateServerF\" method=\"get\"><button>Updade Firmware Server</button></form><br/><form action=\"/updateLedF\" method=\"get\"><button>Updade Firmware Led</button></form><br/><form action=\"/eF\" method=\"post\"><button>Exit</button></form>";
const char HTTP_PORTAL_OPTIONSF[] PROGMEM  = "<form action=\"/iF\" method=\"get\"><button>Info</button></form><br/><form action=\"/rF\" method=\"post\"><button>Reset Factory</button></form><br/><form action=\"/updateFirm\" method=\"get\"><button>Updade Firmware</button></form><br/><form action=\"/eF\" method=\"post\"><button>Exit</button></form>";

const char HTTP_PORTAL_UPDATEF[] PROGMEM  = "<form action=\"/updateServerF\" method=\"get\"><button>Updade Firmware Server</button></form><br/><form action=\"/updateLedF\" method=\"get\"><button>Updade Firmware Led</button></form><br/><form action=\"/eF\" method=\"post\"><button>Exit</button></form>";

const char HTTP_FORM_YES_NO_END[] PROGMEM = "<form action=\"/yF\" method=\"post\"><button>Yes</button></form><br/><form action=\"/nF\" method=\"post\"><button>No</button></form>";

const char getpasscodeupdate[] PROGMEM = 
	"<form method='get'>"
	"<input id='s' name='userid' length=32 placeholder='Username'><br/>"
	"<input id='p' name='pwd' length=64 type='Password' placeholder='Password'><br/>"    
	"<br/><br/><button type='submit' onclick='check(this.form)' value='Login'>Login</button></form>";

const char getpasscode_SCRIPT[] PROGMEM = 
"<script>"
    "function check(form)"
    "{"
    "if(form.userid.value=='admin' && form.pwd.value=='admin')"
    "{"
    "window.open('/rootupdateFirm')"
    "}"
    "else"
    "{"
    " alert('Error Password or Username')/*displays error message*/"
    "}"
    "}"
"</script>";

const char test_dropdown[] PROGMEM = 
"<!DOCTYPE html>"
"<html>"
"<body>"

"<h1>The select element</h1>"

"<p>The select element is used to create a drop-down list.</p>"

"<form method='get' action='/action_page.php'>"
"  <label for='cars'>Choose a car:</label>"
"  <select name='cars' id='cars'>"
"    <option value='volvo'>Volvo</option>"
"    <option value='saab'>Saab</option>"
"    <option value='opel'>Opel</option>"
"    <option value='audi'>Audi</option>"
"  </select>"
"  <br><br>"
"  <input type='submit' value='Submit'>"
"</form>"

"<p>Click the 'Submit' button and the form-data will be sent to a page on the "
"server called 'action_page.php'.</p>"

"</body>"
"</html>";

//"<br/><input id='{i}' name='{n}' length={l} placeholder='{p}' value='{v}' {c}>";
const char Leddropdown[] PROGMEM = 
"<h3>Config led screen</h3>"
"<form method='get' action='action_page'>"
"<p>Width:</p>"
"<input id='Width' name='Width' length=32 placeholder='Width Screen' value='96'><br/>"
"<p>Heigh:</p>"
"<input id='Heigh' name='Heigh' length=32 placeholder='Heigh Screen' value='32'><br/>"
"<br/>"
"  <label for='cars'>Choose a Led:</label>"
"  <select name='cars' id='cars'>"
"    <option value='p10out'>P10 Outdoor</option>"
"    <option value='p10in'>P10 Indoor</option>"
"  </select>"
"  <br/>"
"<br/><button type='submit'>save</button>"
"</form>";
//---------End MrCong add------------------------


#define WIFI_MANAGER_MAX_PARAMS 12

class WiFiManagerParameter {
  public:
    WiFiManagerParameter(const char *custom);
    WiFiManagerParameter(const char *id, const char *placeholder, const char *defaultValue, int length);
    WiFiManagerParameter(const char *id, const char *placeholder, const char *defaultValue, int length, const char *custom);

    const char *getID();
    const char *getValue();
    const char *getPlaceholder();
    int         getValueLength();
    const char *getCustomHTML();
  private:
    const char *_id;
    const char *_placeholder;
    char       *_value;
    int         _length;
    const char *_customHTML;

    void init(const char *id, const char *placeholder, const char *defaultValue, int length, const char *custom);

    friend class WiFiManager;
};


class WiFiManager
{
  public:
    WiFiManager();

    void       	setsavecommand(uint16_t *regs);
	void		setsaveledcommand (uint16_t *regs);
	
	boolean       autoConnect();
    boolean       autoConnect(char const *apName, char const *apPassword = NULL);

    //if you want to always start the config portal, without trying to connect first
    boolean       startConfigPortal();
    boolean       startConfigPortal(char const *apName, char const *apPassword = NULL);
	boolean       startConfigPortalF();
    boolean       startConfigPortalF(char const *apName, char const *apPassword = NULL);

    // get the AP name of the config portal, so it can be used in the callback
    String        getConfigPortalSSID();
    String        getSSID();
    String        getPassword();
    void          resetSettings();

    //sets timeout before webserver loop ends and exits even if there has been no setup.
    //useful for devices that failed to connect at some point and got stuck in a webserver loop
    //in seconds setConfigPortalTimeout is a new name for setTimeout
    void          setConfigPortalTimeout(unsigned long seconds);
    void          setTimeout(unsigned long seconds);

    //sets timeout for which to attempt connecting, useful if you get a lot of failed connects
    void          setConnectTimeout(unsigned long seconds);
	//MrCong them ham nay: cho phep cau hinh lai wifi
	void          setConfigwifi(int value);

    void          setDebugOutput(boolean debug);
    //defaults to not showing anything under 8% signal quality if called
    void          setMinimumSignalQuality(int quality = 8);
    //sets a custom ip /gateway /subnet configuration
    void          setAPStaticIPConfig(IPAddress ip, IPAddress gw, IPAddress sn);
    //sets config for a static IP
    void          setSTAStaticIPConfig(IPAddress ip, IPAddress gw, IPAddress sn);
    //called when AP mode and config portal is started
    void          setAPCallback( void (*func)(WiFiManager*) );
    //called when settings have been changed and connection was successful
    void          setSaveConfigCallback( void (*func)(void) );
    //adds a custom parameter
    void          addParameter(WiFiManagerParameter *p);
    //if this is set, it will exit after config, even if connection is unsuccessful.
    void          setBreakAfterConfig(boolean shouldBreak);
    //if this is set, try WPS setup when starting (this will delay config portal for up to 2 mins)
    //TODO
    //if this is set, customise style
    void          setCustomHeadElement(const char* element);
    //if this is true, remove duplicated Access Points - defaut true
    void          setRemoveDuplicateAPs(boolean removeDuplicates);

  private:
    std::unique_ptr<DNSServer>        dnsServer;
#ifdef ESP8266
    std::unique_ptr<ESP8266WebServer> server;
#else
    std::unique_ptr<WebServer>        server;
#endif

std::unique_ptr<HTTPUpload> upload;
// HTTPUpload& upload = server->upload();

    //const int     WM_DONE                 = 0;
    //const int     WM_WAIT                 = 10;
	uint16_t *au16regs;
	uint16_t *au16regsled;
	int bancodongykhong=0;
    //const String  HTTP_HEAD_CONG = "<!DOCTYPE html><html lang=\"en\"><head><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"/><title>{v}</title>";

    void          setupConfigPortal();
	void          setupConfigPortalF();
    void          startWPS();

    const char*   _apName                 = "no-net";
    const char*   _apPassword             = NULL;
    String        _ssid                   = "";
    String        _pass                   = "";
    unsigned long _configPortalTimeout    = 0;
    unsigned long _connectTimeout         = 0;
	int			_configwifi				=0;
    unsigned long _configPortalStart      = 0;

    IPAddress     _ap_static_ip;
    IPAddress     _ap_static_gw;
    IPAddress     _ap_static_sn;
    IPAddress     _sta_static_ip;
    IPAddress     _sta_static_gw;
    IPAddress     _sta_static_sn;

    int           _paramsCount            = 0;
    int           _minimumQuality         = -1;
    boolean       _removeDuplicateAPs     = true;
    boolean       _shouldBreakAfterConfig = false;
    boolean       _tryWPS                 = false;

    const char*   _customHeadElement      = "";

    //String        getEEPROMString(int start, int len);
    //void          setEEPROMString(int start, int len, String string);

    int           status = WL_IDLE_STATUS;
    int           connectWifi(String ssid, String pass);
    uint8_t       waitForConnectResult();

    void          handleRoot();
    void          handleWifi(boolean scan);
	void          handleLedSet();
    void          handleWifiSave();
    void          handleInfo();
    void          handleReset();
    void          handleNotFound();
    void          handle204();
    boolean       captivePortal();
    boolean       configPortalHasTimeout();
	
	/** MrCong thêm*/
	void          handleRootF();
    void          handleInfoF();
	void          handleResetF();
	void 		  handleGetpasscode();
	void		  handleRoot_dapdatefirmware();
	void          handleUpdateServerF();
	void          handleUpdateLedF();
	void          handleExit();
		void 			handlereadtest();
	
	void			handleUpdateServernow();
	void			handleUpdateServerresult();
    
   
    void          handleNotFoundF();
	void		handleYesF();
	void		handleNoF();
    // void          handle204();
    // boolean       captivePortal();
    // boolean       configPortalHasTimeout();
	
	/** End MrCong thêm*/

    // DNS server
    const byte    DNS_PORT = 53;

    //helpers
    int           getRSSIasQuality(int RSSI);
    boolean       isIp(String str);
    String        toStringIp(IPAddress ip);

    boolean       connect;
	int       connectF;
    boolean       _debug = true;

    void (*_apcallback)(WiFiManager*) = NULL;
    void (*_savecallback)(void) = NULL;

    WiFiManagerParameter* _params[WIFI_MANAGER_MAX_PARAMS];

    template <typename Generic>
    void          DEBUG_WM(Generic text);

    template <class T>
    auto optionalIPFromString(T *obj, const char *s) -> decltype(  obj->fromString(s)  ) {
      return  obj->fromString(s);
    }
    auto optionalIPFromString(...) -> bool {
      DEBUG_WM("NO fromString METHOD ON IPAddress, you need ESP8266 core 2.1.0 or newer for Custom IP configuration to work.");
      return false;
    }
};

#endif
